//Завдання 3: Генерація таблиці множення

//Створіть програму, яка генерує таблицю множення для обраного числа за допомогою кожного з циклів for, while .

/*Виберіть число для якого потрібно згенерувати таблицю множення.
Використовуючи цикл for, створіть таблицю множення для обраного числа від 1 до 10. Виведіть результат в консоль.
Використовуючи цикл while створіть аналогічну таблицю множення та виведіть її в консоль.*/
import chalk from 'chalk';
const number1 = 6;
const number2 = 9;
for (let i = 1; i <= 10; i++) {
    console.log(chalk.red (`${number1}`) + ` x `+ chalk.blue(`${i}`)+` = `+ chalk.blue(`${number1 * i}`) + `     ` + chalk.red (`${number2}`) + ` x `+ chalk.blue(`${i}`)+` = `+ chalk.blue(`${number2 * i}`));
    //console.log(`${number1} x ${i} = ${number1 * i}` + `     ` + `${number2} x ${i} = ${number2 * i}`);
}