/*Завдання 3
Створіть об'єкт car1 з такими властивостями:
brand: рядок, представляє марку автомобіля.
model: рядок, представляє модель автомобіля.
year: число, представляє рік випуску автомобіля.
Створіть об'єкт car2 з такими властивостями:
brand: рядок, представляє марку автомобіля.
model: рядок, представляє модель автомобіля.
owner: число, представляє рік випуску автомобіля.
Створіть об'єкт car3. Використайте оператор spread щоб додати всі властивості що є в car1 та car2 до об’єкту car3.
Виведіть об'єкт car3 в консоль.*/


const car1 = {
  brand: "Toyota",
  model: "Corolla",
  year: 2020
};

const car2 = {
  brand: "Honda",
  model: "Civic",
  owner: 2022
};

/*Важливо пам’ятати, що ключі в об’єкті мають унікальні імена. 
Тому якщо ви “розпиляєте” властивості одного об’єкта в інший і обидва 
об’єкти мають ключі з однаковим іменем то в результаті ви отримаєте те значення яке було вказано останнім.*/

const car3 = { ...car1, ...car2 };

console.log(car3);